app/controllers/urls_controller.rb

  def show

    begin

      url = Url.new
      original_url = url.find_by_short_url(@@URL + params[:short_url]).original_url
---
SELECT  "urls".* FROM "urls" WHERE "urls"."short_url" = ? LIMIT ?  [["short_url", "http://codigofacilito.com/videos/curso_ruby_on_rails_desde_cero_enviar_datos_al_co1"], ["LIMIT", 1]]

  def create

    url = Url.new
    url.original_url = params[:original_url]

    if url.sanitize? # Check that the URL is in the correct format

      if url.find? # Check if the URL has already been shortened previously

        url.short_url_algorithm()
        url.visit_count = 0
        url.save

        job = GetTitleJob.new
        job.get_title(url.short_url)

        respond_to do |format|
          format.html { redirect_to shortened_path(original_url: url.original_url, short_url: url.short_url, title: url.find_duplicate.title, visit_count: url.visit_count, obs: "New Url") }
          format.json { render json: {status: 'SUCCESS', data:[{original_url: url.original_url, short_url: url.short_url, title: url.find_duplicate.title, visit_count: url.visit_count, obs: "New Url"}]}, status: :ok }
        end

      else

        respond_to do |format|
          format.html { redirect_to shortened_path(original_url: url.original_url, short_url: url.find_duplicate.short_url, title: url.find_duplicate.title, visit_count: url.find_duplicate.visit_count, obs: "The Url has already been shortened") }
          format.json { render json: {status: 'SUCCESS', data:[{original_url: url.original_url, short_url: url.find_duplicate.short_url, title: url.find_duplicate.title, visit_count: url.find_duplicate.visit_count, obs: "The Url has already been shortened"}]}, status: :ok }
---
SELECT  "urls".* FROM "urls" WHERE "urls"."short_url" = ? LIMIT ?  [["short_url", "BeNaUQ"], ["LIMIT", 1]]