app/controllers/urls_controller.rb

  def show

    begin

      url = Url.new
      original_url = url.find_by_short_url("http://localhost:3000/" + params[:short_url]).original_url
      url.update_visits("http://localhost:3000/" + params[:short_url])
---
SELECT  "urls".* FROM "urls" WHERE "urls"."short_url" = ? LIMIT ?  [["short_url", "BeNaUQ"], ["LIMIT", 1]]
UPDATE "urls" SET "visit_count" = ?, "updated_at" = ? WHERE "urls"."id" = ?  [["visit_count", 77], ["updated_at", "2019-05-29 21:06:41.092129"], ["id", 6]]

  def create

    url = Url.new
    url.original_url = params[:original_url]

    if url.sanitize?

      if url.find?

        url.generate_short_url("http://localhost:3000/")
        url.visit_count = 0
        url.save

        job = GetTitleJob.new
        job.get_title(url.short_url)

        respond_to do |format|
          format.html { redirect_to shortened_path(original_url: url.original_url, short_url: url.short_url, title: url.find_duplicate.title, visit_count: url.visit_count, obs: "New shortened") }
          format.json { render json: {status: 'SUCCESS', data:url.short_url}, status: :ok }
        end

      else

        respond_to do |format|
          format.html { redirect_to shortened_path(original_url: url.original_url, short_url: url.find_duplicate.short_url, title: url.find_duplicate.title, visit_count: url.find_duplicate.visit_count, obs: "Before shortened") }
          format.json { render json: {status: 'SUCCESS', data:url.find_duplicate.short_url}, status: :ok }
---
SELECT  "urls".* FROM "urls" WHERE "urls"."original_url" = ? LIMIT ?  [["original_url", "https://stackoverflow.com/questions/39980142/rails-5-no-flash-notice-message"], ["LIMIT", 1]]
UPDATE "urls" SET "title" = ?, "updated_at" = ? WHERE "urls"."id" = ?  [["title", "El job se ha ejecutado"], ["updated_at", "2019-05-30 14:04:21.607060"], ["id", 14]]
INSERT INTO "urls" ("original_url", "short_url", "visit_count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
SELECT  "urls".* FROM "urls" WHERE "urls"."short_url" = ? LIMIT ?  [["short_url", "http://codigofacilito.com/videos/curso_ruby_on_rails_desde_cero_enviar_datos_al_co11111111"], ["LIMIT", 1]]
SELECT  "urls".* FROM "urls" WHERE "urls"."short_url" = ? LIMIT ?  [["short_url", "C1XeGP"], ["LIMIT", 1]]
SELECT  "urls".* FROM "urls" WHERE "urls"."short_url" = ? LIMIT ?  [["short_url", "https://docs.google.com/document/d/1-7rV5_UCaw_VAYURdu8Dk-xq4H4h7ZuKAQwKlW"], ["LIMIT", 1]]