app/models/url.rb

  def short_url_algorithm()

    unique_id_length = 2

    loop do
      self.short_url = @@URL + (Base64.encode64(self.original_url)[0..unique_id_length])
      # self.short_url = @@URL + ([*('a'..'z'),*('0'..'9')]).sample(unique_id_length).join # Other way to make the algorithm
      if Url.find_by_short_url(self.short_url).nil?
---
SELECT  "urls".* FROM "urls" WHERE "urls"."short_url" = ? LIMIT ?  [["short_url", "localhost:3000/VFjOSa"], ["LIMIT", 1]]

  def find_duplicate
    Url.find_by_original_url(self.original_url)
---
SELECT  "urls".* FROM "urls" WHERE "urls"."original_url" = ? LIMIT ?  [["original_url", "https://www.instagram.com/?hl=es-la"], ["LIMIT", 1]]

  def find_by_short_url(short_url)
    Url.find_by_short_url(short_url)
---
SELECT  "urls".* FROM "urls" WHERE "urls"."short_url" = ? LIMIT ?  [["short_url", "localhost:3000/FbkNP9"], ["LIMIT", 1]]

  def update_visits(short_url)

    url = Url.find_by_short_url(short_url)
    url.visit_count = url.visit_count + 1
    url.save
---
SELECT  "urls".* FROM "urls" WHERE "urls"."short_url" = ? LIMIT ?  [["short_url", "http://localhost:3000/aHR0"], ["LIMIT", 1]]
UPDATE "urls" SET "visit_count" = ?, "updated_at" = ? WHERE "urls"."id" = ?  [["visit_count", 1], ["updated_at", "2019-06-09 02:02:31.409077"], ["id", 3]]

  def top
    Url.order(visit_count: :desc).limit(100)
---
SELECT  "urls".* FROM "urls" ORDER BY "urls"."visit_count" ASC LIMIT ?  [["LIMIT", 100]]

  def date
    Url.order(created_at: :desc).limit(1)
---
SELECT  "urls".* FROM "urls" ORDER BY "urls"."created_at" ASC LIMIT ?  [["LIMIT", 1]]