app/jobs/get_title_job.rb

SELECT  "urls".* FROM "urls" WHERE "urls"."short_url" = ? LIMIT ?  [["short_url", "https://fullstackchallenge2019.herokuapp.com/dq"], ["LIMIT", 1]]
UPDATE "urls" SET "title" = ?, "updated_at" = ? WHERE "urls"."id" = ?  [["title", "WhatsApp Web"], ["updated_at", "2019-06-10 19:51:56.151099"], ["id", 22]]
---
  	def get_title(new_url)

	    url = Url.find_by_short_url(new_url)
	    page = MetaInspector.new(url.original_url)
	    url.title = page.title
	    url.save